Area Reinforcement can be placed only in Structural Floors and straight Structural Walls.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId AreaReinforcementWrongHost { get; }
  Visual Basic
Public Shared ReadOnly Property AreaReinforcementWrongHost As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ AreaReinforcementWrongHost {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarSystemFailures Class
  Autodesk.Revit.DB Namespace